from telegram import InlineKeyboardButton, InlineKeyboardMarkup


class Question:
    help_text = """راهنمای انجام تست‌ها:

فهرست زیر حاوی جمله‌هایی است که یک شخص ممکن است برای توصیف خودش از آنها استفاده کند. لطفا هر جمله را با دقت بخوانید و ببینید تا چه حد شما را درست توصیف می‌کند.
اگر شما برای پاسخ دادن خاطر جمع نیستید، بر پایه‌ی چیزی که احساس می‌کنید، جواب دهید نه بر اساس آنچه فکر می‌کنید درست است.
تعدادی از جملات در مورد رابطه با والدینتان و یا والدینی تخیلی می‌باشد. چنانچه هر یک از والدینتان یا هر دوی آنها فوت شده‌اند، لطفا به این جملات بر اساس ارتباطتان با والدینتان وقتی که آنها زنده بوده‌اند پاسخ دهید؛ اگر در گذشته با والدینتان بوده‌اید اما در حال حاضر نیستید، لطفا به جملات بر اساس آخرین و مهمترین ارتباط رومانتیک پاسخ دهید.
یکی از شماره‌های ۱ تا ۶ از مقیاس درجه بندی که بهترین توصیف از شما را ارائه می‌دهد انتخاب کنید:‌ 
کاملاً غلط = ۱
تقریبا غلط = ۲
بیشتر درست است تا غلط = ۳
اندکی درست = ۴
تقریبا درست = ۵
کاملاً درست = ۶
 سپس نمره‌ی مربوطه را علامت بزنید. """ 
    QUESTIONS = {'Q1': '1: کسی را نداشته‌ام که از من حمایت کند، حرف هایش را با من بزند و عمیقاً نگران اتفاقاتی باشد که برایم پیش می‌آید.',
                 'Q2': '2: من به افراد نزدیک خودم خیلی می‌چسبم، چون می‌ترسم مرا ترک کنند.',
                 'Q3': '3: احساس می‌کنم افراد از من سودجویی خواهند کرد.',
                 'Q4': '4: فکر می‌کنم فرد مناسبی برای اجتماع نیستم.',
                 'Q5': '5: هنگامی که مردان یا زنانی که دوستشان دارم، نقاط ضعف یا عیب مرا ببینند، دیگر دوستم نخواهند داشت.',
                 'Q6': '6: تقریباً هیچ کاری را نمی‌توانم در سرکار (یا در مدرسه، دانشگاه) به خوبی دیگران انجام دهم.',
                 'Q7': '7:  احساس می‌کنم به تنهایی نمی‌توانم از پس کارهای زندگی روزانه‌ام بر بیایم.',
                 'Q8': '8: نمی‌توانم از شر این احساس رها شوم که ممکن است اتفاق بدی بیوفتد.',
                 'Q9': '9: قادر نیستم از والدینم جدا شوم، کاری که هم‌سن و سال‌هایم انجام می‌دهند.',
                 'Q10': '10: فکر می‌کنم اگر کاری را بکنم که دلم می‌خواهد، برای خودم دردسر درست می‌کنم.',
                 'Q11': '11:  کار مراقبت از نزدیکانم، شیوه‌ی رفتار من می‌باشد.',
                 'Q12': '12: از این که احساسات مثبتم (مثل محبت و توجه) را به دیگران نشان بدهم، خیلی خجالت می‌کشم.',
                 'Q13': '13: باید در هرکاری که انجام می‌دهم، بهترین باشم، نمی‌توانم توقعم را کم کنم.',
                 'Q14': '14: وقتی از کسی چیزی می‌خواهم، خیلی برایم سخت است نه بشنوم.',
                 'Q15': '15: نمی‌توانم برای انجام تمام و کمال وظایف روزمره یا خسته کننده، نظم و انظباط خاصی داشته باشم.',
                 'Q16': '16: داشتن پول و شناخت افراد مهم در من احساس ارزشمندی ایجاد می‌کند.',
                 'Q17': '17: حتی مواقعی که چیزها به خوبی جریان می‌یابند، من احساس می‌کنم آن‌ها موقتی و به زودی پایان می‌یابند.',
                 'Q18': '18: چنانکه اشتباهی مرتکب شوم، سزاوار تنبیه هستم.',
                 'Q19': '19: کسی نداشته‌ام که به من عاطفه، محبت و صداقت نشان دهد.',
                 'Q20': '20: آنقدر به دیگران نیازمند هستم که نگران از دست دادن آن‌ها هستم.',
                 'Q21': '21: احساس می‌کنم باید در حضور دیگران از خودم محافظت کنم، چون فکر می‌کنم در غیر اینصورت به من آسیب می‌زنند.',
                 'Q22': '22: اساساً با بقیه خیلی فرق دارم.',
                 'Q23': '23: اگر کسی که من او را دوست دارم، بداند که من واقعاً چه کسی هستم، نمی‌خواهد در کنار من بماند.',
                 'Q24': '24: وقتی به موفقیت هایم نظر می‌اندازم از درون احساس بی‌کفایتی می‌کنم.',
                 'Q25': '25: وقتی به عملکرد روزانه‌ام فکر می‌کنم، خودم را آدم وابسته‌ای می‌بینم.',
                 'Q26': '26: احساس می‌کنم هر لحظه ممکن است یک فاجعه (طبیعی، جنایی، حقوقی یا بیماری) برایم اتفاق بیوفتد.',
                 'Q27': '27: من و والدینم تمایل داریم خود را بیش از حد در مشکلات زندگی یکدیگر درگیر کنیم.',
                 'Q28': '28: احساس می‌کنم چاره‌ای ندارم جز اینکه به خواسته‌های دیگران تن در بدهم، چون در غیر اینصورت مرا ترک می‌کنند یا در صدد تلافی بر می‌آیند.',
                 'Q29': '29: آدم خوبی هستم، چون بیش از آنچه به فکر خودم باشم به فکر دیگران هستم.',
                 'Q30': '30: برای بیان احساساتم به دیگران خجالت می‌کشم.',
                 'Q31': '31: سعی می کنم نهایت تلاش خودم را بکنم، اینکه کار ”تا حدی خوب باشد“ هیچ‌گاه راضی‌ام نمی‌کند.',
                 'Q32': '32: آدم خاصی هستم و نمی‌توانم محدودیت‌هایی که بر سر راه افراد وجود دارد را بپذیرم. ',
                 'Q33': '33: اگر به یکی از اهدافم نرسم، زود مأیوس می‌شوم و دست از کار می‌کشم.',
                 'Q34': '34: تمام پروژه‌ها موقعی برای من ارزشمند است که دیگران به آن توجه کنند.',
                 'Q35': '35: اگر چیز خوبی اتفاق بیوفتد، از اینکه احتمال دارد به دنبال آن چیز بدی اتفاق بیوفتد، نگران می‌شوم.',
                 'Q36': '36: اگر سخت‌ترین تلاش را نکنم باید انتظار از دست دادن سرمایه و وقت را هم داشته باشم.',
                 'Q37': '37: احساس نمی‌کنم که برای فرد دیگری شخص خاصی به حساب بیایم.',
                 'Q38': '38: نگرانم از اینکه افرادی که به من نزدیک‌اند، مرا ترک و رها کنند.',
                 'Q39': '39: دیگران دیر یا زود به من خیانت می‌کنند.',
                 'Q40': '40: به کسی تعلق خاطر ندارم، فرد تنهایی هستم.',
                 'Q41': '41: لیاقت عشق، توجه و احترام از طرف دیگران را ندارم.',
                 'Q42': '42: بسیاری از افراد در زمینه های کاری و حرفه‌ای خود از من تواناترند.',
                 'Q43': '43: فاقد احساس جمعی و مشترک هستم.',
                 'Q44': '44: نگرانم به وسیله‌ای دیگران مورد حمله‌ی فیزیکی قرار گیرم.',
                 'Q45': '45: برای من و والدینم بسیار سخت است که بدون داشتن احساس گناه یا خیانت، مسائل جزیی و خصوصی خود را از دیگران پنهان نگاه دارم.',
                 'Q46': '46: در روابطم معمولاً به دیگران اجازه می‌دهم که بالاتر از من باشند.',
                 'Q47': '47: آنقدر سرگرم انجام کارهای دیگران هستم که نمی‌توانم وقت فراقتی را برای خود داشته باشم.',
                 'Q48': '48: برای من خیلی سخت است که با آزادی خاطر و به صورت خودجوش در جوار دیگران رفتار کنم.',
                 'Q49': '49: باید به تمام مسئولیت‌هایم عمل کنم.',
                 'Q50': '50: از اینکه مرا محدود کنند یا نگذارند کاری را که من می‌خواهم بکنم، متنفرم.',
                 'Q51': '51: برای من خیلی سخت است که رضایت یا خواسته‌های آنی خود را فدای اهداف بلند مدت کنم.',
                 'Q52': '52: در صورتی که توجه کافی از سوی دیگران دریافت نکنم، احساس کم اهمیت بودن می‌کنم.',
                 'Q53': '53: شما نمی‌توانید کاملاً مراقب باشید، زیرا برخی چیزها تقریبا همیشه اشتباه از آب در می‌آیند.',
                 'Q54': '54: اگر شغلم را به درستی انجام ندهم، باید از پیامد آن رنج بکشم.',
                 'Q55': '55: کسی را نداشته‌ام که واقعاً به درد دل من گوش کند،  مرا بفهمد یا اینکه احساس‌ها و نیازهای واقعی مرا درک کند. ',
                 'Q56': '56: وقتی احساس می‌کنم کسی که برایم مهم است از من دوری می‌کند، احساس یأس می‌کنم.',
                 'Q57': '57: نسبت به انگیزه‌های دیگران سوء ظن شدید دارم.',
                 'Q58': '58: احساس می‌کنم که از مردم بیگانه بریده شدم.',
                 'Q59': '59: احساس می‌کنم دوست داشتنی نیستم.',
                 'Q60': '60: می‌توانم مانند اغلب افراد در کارهایم با استعداد باشم.',
                 'Q61': '61: اصلاً به قضاوت های خودم در موقعیت‌های روزمره اعتماد ندارم.',
                 'Q62': '62: می‌ترسم تمام سرمایه‌ی خود را از دست بدهم و بیچاره و فقیر شوم.',
                 'Q63': '63: اغلب احساس می‌کنم که انگار والدینم در من زندگی می‌کنند، من نمی‌توانم زندگی جداگانه‌ای برای خودم داشته باشم.',
                 'Q64': '64: همیشه به دیگران اجازه داده ام به جای من تصمیم بگیرند، در نتیجه من واقعاً نمی‌دانم چه می‌خواهم.',
                 'Q65': '65: من همیشه سنگ صبور دیگران بوده‌ام و به مشکلات آن‌ها گوش داده‌ام.',
                 'Q66': '66: آنقدر خودم را کنترل می‌کنم که افراد فکر می‌کنند آدم بدون هیجان و بی‌احساس هستم.',
                 'Q67': '67: احساس می‌کنم برای پیشرفت و دستیابی به خواسته‌های خود همواره تحت فشار هستم.',
                 'Q68': '68: احساس می‌کنم نباید از قانون‌ها و قراردادهای به هنجاری که مردم تابع آن‌ها هستند، اطاعت کنم.',
                 'Q69': '69: نمی‌توانم به خود فشار بیاورم که کارهایی که برایم خوش‌آیند نیستند را انجام دهم، حتی وقتی که می‌دانم نتایج خوبی در پی دارند.',
                 'Q70': '70: اگر در مجالسی اظهار نظر کنم یا در موقعیت‌های اجتماعی آغازگر بحث باشم، برایم مهم است که دیگران مرا بشناسند و تأیید کنند.',
                 'Q71': '71: وقتی کاری می‌کنم برایم مهم نیست که چقدر سخت است اما نگرانم از لحاظ مالی ورشکست بشوم و همه‌ی دارایی‌هایم را از دست بدهم.',
                 'Q72': '72: وقتی کار اشتباهی انجام می‌دهم، برایم مهم نیست که چرا اشتباه می‌کنم، باید تاوان آن را بپردازم.',
                 'Q73': '73: وقتی نمی‌دانستم کاری را چگونه انجام دهم، شخص عاقل و ماهری را پیدا نمی‌کردم که مرا راهنمایی و نصیحت کند.',
                 'Q74': '74: برخی اوقات آنقدر نگران آن هستم که نکند افراد مرا ترک کنند که از آن‌ها دوری می‌کنم.',
                 'Q75': '75: به طور جدی به انگیزه‌های نهانی مردم فکر می‌کنم.',
                 'Q76': '76: همیشه احساس می‌کنم که در بین افراد گروه جایی ندارم.',
                 'Q77': '77: در بسیاری از موقعیت‌ها برای نشان دادن یا ابراز کردن خودم از طرف دیگران پذیرفتنی نیستم.',
                 'Q78': '78: در کار یا تحصیل مثل بقیه باهوش نیستم.',
                 'Q79': '79: احساس می‌کنم قادر نیستم به تنهایی مسائلی که برایم اتفاق می‌افتد را حل کنم.',
                 'Q80': '80: اغلب نگرانم که دچار یک بیماری جدی شوم، حتی وقتی که دلایل پزشکی کمی برای این احتمال وجود دارد.',
                 'Q81': '81: اغلب احساس می‌کنم که هویت جداگانه‌ای از والدین و همسرم ندارم.',
                 'Q82': '82: خیلی برایم مشکل است از دیگران تقاضا کنم که حقوقم را رعایت و احساساتم را درک کنند.',
                 'Q83': '83: نظر دیگران این است که من برای دیگران خیلی کار می‌کنم ولی برای خودم کاری انجام نمی‌دهم.',
                 'Q84': '84: مردم نظرشان این است که من از نظر هیجانی ضعیف هستم.',
                 'Q85': '85: وقتی کاری را اشتباه انجام می‌دهم، نمی‌توانم خودم را ببخشم یا برای اشتباهم بهانه تراشی می‌کنم.',
                 'Q86': '86: احساس می‌کنم کاری که من برای دیگران انجام می‌دهم بیشتر از کارهایی است که آن‌ها برای من انجام می‌دهند.',
                 'Q87': '87: به ندرت توانسته‌ام به تصمیم خودم پایبند باشم.',
                 'Q88': '88: تحسین زیاد در من این احساس را ایجاد می‌کند که فرد باارزشی هستم.',
                 'Q89': '89: نگرانم از اینکه تصمیم اشتباهی بگیرم زیرا آن موجب بدبختی‌ام می‌شود.',
                 'Q90': '90: فرد بدی هستم و سزاوار تنبیه می‌باشم.'}

    last_q = 'Q' + str(len(QUESTIONS))
    resault_tempalte = {
        'رهاشدگی بی ثباتی': 0,
        'انزوای اجتماعی، بیگانگی': 0,
        'نگرانی / بدبینی': 0,
        'بازداری هیجانی': 0,
        'وابستگی / بی‌کفایتی عملی': 0,
        'پذیرش‌جویی جلب توجه': 0,
        'محرومیت‌های هیجانی': 0,
        'آسیب نسبت به ضرر و بیماری': 0,
        'گرفتاری': 0,
        'اطاعت': 0,
        'معیارهای سخت‌گیرانه': 0,
        'خود تنبیهی': 0,
        'نقص / شرم': 0,
        'بی‌اعتمادی بدرفتاری': 0,
        'شکست': 0,
        'ایثار': 0,
        'استحقاق بزرگ‌منشی': 0,
        'خویشتن داری ناکافی': 0}

    resault_map = {
        'رهاشدگی بی ثباتی': [2, 20, 38, 56, 74],
        'انزوای اجتماعی، بیگانگی': [4, 22, 40, 58, 76],
        'نگرانی / بدبینی': [17, 35, 53, 71, 89],
        'بازداری هیجانی': [12, 30, 48, 66, 84],
        'وابستگی / بی‌کفایتی عملی': [7, 25, 43, 61, 79],
        'پذیرش‌جویی جلب توجه': [16, 34, 52, 70, 88],
        'محرومیت‌های هیجانی': [1, 19, 37, 55, 73],
        'آسیب نسبت به ضرر و بیماری': [8, 26, 44, 62, 80],
        'گرفتاری': [9, 27, 45, 63, 81],
        'اطاعت': [10, 28, 46, 64, 82],
        'معیارهای سخت‌گیرانه': [13, 31, 49, 67, 85],
        'خود تنبیهی': [18, 36, 54, 72, 90],
        'نقص / شرم': [5, 23, 41, 59, 77],
        'بی‌اعتمادی بدرفتاری': [3, 21, 39, 57, 75],
        'شکست': [6, 24, 42, 60, 78],
        'ایثار': [11, 29, 47, 65, 83],
        'استحقاق بزرگ‌منشی': [14, 32, 50, 68, 86],
        'خویشتن داری ناکافی': [15, 33, 51, 69, 87]}

    @classmethod
    def keyboard_generator(cls, question: str, active_index=None):
        buttons = [
            [
                InlineKeyboardButton(text=f'👉 {i}', callback_data=f'{question}-{i}') if active_index == i
                else InlineKeyboardButton(text=f'  {i}  ', callback_data=f'{question}-{i}')
                for i in range(1, 7)
            ]
        ]
        question_temp = question.replace('Q', '')
        next_q = 'Q' + str(int(question_temp) + 1)
        previous_q = 'Q' + str(int(question_temp) - 1)
        if cls.QUESTIONS.get(next_q) != None:
            buttons.append([InlineKeyboardButton(
                'بعدی', callback_data='next-' + next_q)])

        if cls.QUESTIONS.get(previous_q) != None:
            buttons.append([InlineKeyboardButton(
                'قبلی', callback_data='previous-' + previous_q)])

        if question == cls.last_q:
            buttons.append([InlineKeyboardButton(
                'پایان', callback_data='finish-' + question)])

        return InlineKeyboardMarkup(buttons)
