from telegram import InlineKeyboardButton, InlineKeyboardMarkup


class Schema_Questions:
    help_text = """راهنمای انجام تست‌ها:

فهرست زیر حاوی جمله‌هایی است که یک شخص ممکن است برای توصیف خودش از آنها استفاده کند. لطفا هر جمله را با دقت بخوانید و ببینید تا چه حد شما را درست توصیف می‌کند.
اگر شما برای پاسخ دادن خاطر جمع نیستید، بر پایه‌ی چیزی که احساس می‌کنید، جواب دهید نه بر اساس آنچه فکر می‌کنید درست است.
تعدادی از جملات در مورد رابطه با والدینتان و یا والدینی تخیلی می‌باشد. چنانچه هر یک از والدینتان یا هر دوی آنها فوت شده‌اند، لطفا به این جملات بر اساس ارتباطتان با والدینتان وقتی که آنها زنده بوده‌اند پاسخ دهید؛ اگر در گذشته با والدینتان بوده‌اید اما در حال حاضر نیستید، لطفا به جملات بر اساس آخرین و مهمترین ارتباط رومانتیک پاسخ دهید.
یکی از شماره‌های 1 تا 6 از مقیاس درجه بندی که بهترین توصیف از شما را ارائه می‌دهد انتخاب کنید:‌ 
کاملاً غلط = 1
تقریبا غلط = 2
بیشتر درست است تا غلط = 3
اندکی درست = 4
تقریبا درست = 5
کاملاً درست = 6
 سپس نمره‌ی مربوطه را علامت بزنید. """ 
    QUESTIONS = {'Q1': '1: کسی را نداشته‌ام که از من حمایت کند، حرف هایش را با من بزند و عمیقاً نگران اتفاقاتی باشد که برایم پیش می‌آید.',
                 'Q2': '2: من به افراد نزدیک خودم خیلی می‌چسبم، چون می‌ترسم مرا ترک کنند.',
                 'Q3': '3: احساس می‌کنم افراد از من سودجویی خواهند کرد.',
                 'Q4': '4: فکر می‌کنم فرد مناسبی برای اجتماع نیستم.',
                 'Q5': '5: هنگامی که مردان یا زنانی که دوستشان دارم، نقاط ضعف یا عیب مرا ببینند، دیگر دوستم نخواهند داشت.',
                 'Q6': '6: تقریباً هیچ کاری را نمی‌توانم در سرکار (یا در مدرسه، دانشگاه) به خوبی دیگران انجام دهم.',
                 'Q7': '7:  احساس می‌کنم به تنهایی نمی‌توانم از پس کارهای زندگی روزانه‌ام بر بیایم.',
                 'Q8': '8: نمی‌توانم از شر این احساس رها شوم که ممکن است اتفاق بدی بیوفتد.',
                 'Q9': '9: قادر نیستم از والدینم جدا شوم، کاری که هم‌سن و سال‌هایم انجام می‌دهند.',
                 'Q10': '10: فکر می‌کنم اگر کاری را بکنم که دلم می‌خواهد، برای خودم دردسر درست می‌کنم.',
                 'Q11': '11:  کار مراقبت از نزدیکانم، شیوه‌ی رفتار من می‌باشد.',
                 'Q12': '12: از این که احساسات مثبتم (مثل محبت و توجه) را به دیگران نشان بدهم، خیلی خجالت می‌کشم.',
                 'Q13': '13: باید در هرکاری که انجام می‌دهم، بهترین باشم، نمی‌توانم توقعم را کم کنم.',
                 'Q14': '14: وقتی از کسی چیزی می‌خواهم، خیلی برایم سخت است نه بشنوم.',
                 'Q15': '15: نمی‌توانم برای انجام تمام و کمال وظایف روزمره یا خسته کننده، نظم و انظباط خاصی داشته باشم.',
                 'Q16': '16: داشتن پول و شناخت افراد مهم در من احساس ارزشمندی ایجاد می‌کند.',
                 'Q17': '17: حتی مواقعی که چیزها به خوبی جریان می‌یابند، من احساس می‌کنم آن‌ها موقتی و به زودی پایان می‌یابند.',
                 'Q18': '18: چنانکه اشتباهی مرتکب شوم، سزاوار تنبیه هستم.',
                 'Q19': '19: کسی نداشته‌ام که به من عاطفه، محبت و صداقت نشان دهد.',
                 'Q20': '20: آنقدر به دیگران نیازمند هستم که نگران از دست دادن آن‌ها هستم.',
                 'Q21': '21: احساس می‌کنم باید در حضور دیگران از خودم محافظت کنم، چون فکر می‌کنم در غیر اینصورت به من آسیب می‌زنند.',
                 'Q22': '22: اساساً با بقیه خیلی فرق دارم.',
                 'Q23': '23: اگر کسی که من او را دوست دارم، بداند که من واقعاً چه کسی هستم، نمی‌خواهد در کنار من بماند.',
                 'Q24': '24: وقتی به موفقیت هایم نظر می‌اندازم از درون احساس بی‌کفایتی می‌کنم.',
                 'Q25': '25: وقتی به عملکرد روزانه‌ام فکر می‌کنم، خودم را آدم وابسته‌ای می‌بینم.',
                 'Q26': '26: احساس می‌کنم هر لحظه ممکن است یک فاجعه (طبیعی، جنایی، حقوقی یا بیماری) برایم اتفاق بیوفتد.',
                 'Q27': '27: من و والدینم تمایل داریم خود را بیش از حد در مشکلات زندگی یکدیگر درگیر کنیم.',
                 'Q28': '28: احساس می‌کنم چاره‌ای ندارم جز اینکه به خواسته‌های دیگران تن در بدهم، چون در غیر اینصورت مرا ترک می‌کنند یا در صدد تلافی بر می‌آیند.',
                 'Q29': '29: آدم خوبی هستم، چون بیش از آنچه به فکر خودم باشم به فکر دیگران هستم.',
                 'Q30': '30: برای بیان احساساتم به دیگران خجالت می‌کشم.',
                 'Q31': '31: سعی می کنم نهایت تلاش خودم را بکنم، اینکه کار ”تا حدی خوب باشد“ هیچ‌گاه راضی‌ام نمی‌کند.',
                 'Q32': '32: آدم خاصی هستم و نمی‌توانم محدودیت‌هایی که بر سر راه افراد وجود دارد را بپذیرم. ',
                 'Q33': '33: اگر به یکی از اهدافم نرسم، زود مأیوس می‌شوم و دست از کار می‌کشم.',
                 'Q34': '34: تمام پروژه‌ها موقعی برای من ارزشمند است که دیگران به آن توجه کنند.',
                 'Q35': '35: اگر چیز خوبی اتفاق بیوفتد، از اینکه احتمال دارد به دنبال آن چیز بدی اتفاق بیوفتد، نگران می‌شوم.',
                 'Q36': '36: اگر سخت‌ترین تلاش را نکنم باید انتظار از دست دادن سرمایه و وقت را هم داشته باشم.',
                 'Q37': '37: احساس نمی‌کنم که برای فرد دیگری شخص خاصی به حساب بیایم.',
                 'Q38': '38: نگرانم از اینکه افرادی که به من نزدیک‌اند، مرا ترک و رها کنند.',
                 'Q39': '39: دیگران دیر یا زود به من خیانت می‌کنند.',
                 'Q40': '40: به کسی تعلق خاطر ندارم، فرد تنهایی هستم.',
                 'Q41': '41: لیاقت عشق، توجه و احترام از طرف دیگران را ندارم.',
                 'Q42': '42: بسیاری از افراد در زمینه های کاری و حرفه‌ای خود از من تواناترند.',
                 'Q43': '43: فاقد احساس جمعی و مشترک هستم.',
                 'Q44': '44: نگرانم به وسیله‌ای دیگران مورد حمله‌ی فیزیکی قرار گیرم.',
                 'Q45': '45: برای من و والدینم بسیار سخت است که بدون داشتن احساس گناه یا خیانت، مسائل جزیی و خصوصی خود را از دیگران پنهان نگاه دارم.',
                 'Q46': '46: در روابطم معمولاً به دیگران اجازه می‌دهم که بالاتر از من باشند.',
                 'Q47': '47: آنقدر سرگرم انجام کارهای دیگران هستم که نمی‌توانم وقت فراقتی را برای خود داشته باشم.',
                 'Q48': '48: برای من خیلی سخت است که با آزادی خاطر و به صورت خودجوش در جوار دیگران رفتار کنم.',
                 'Q49': '49: باید به تمام مسئولیت‌هایم عمل کنم.',
                 'Q50': '50: از اینکه مرا محدود کنند یا نگذارند کاری را که من می‌خواهم بکنم، متنفرم.',
                 'Q51': '51: برای من خیلی سخت است که رضایت یا خواسته‌های آنی خود را فدای اهداف بلند مدت کنم.',
                 'Q52': '52: در صورتی که توجه کافی از سوی دیگران دریافت نکنم، احساس کم اهمیت بودن می‌کنم.',
                 'Q53': '53: شما نمی‌توانید کاملاً مراقب باشید، زیرا برخی چیزها تقریبا همیشه اشتباه از آب در می‌آیند.',
                 'Q54': '54: اگر شغلم را به درستی انجام ندهم، باید از پیامد آن رنج بکشم.',
                 'Q55': '55: کسی را نداشته‌ام که واقعاً به درد دل من گوش کند،  مرا بفهمد یا اینکه احساس‌ها و نیازهای واقعی مرا درک کند. ',
                 'Q56': '56: وقتی احساس می‌کنم کسی که برایم مهم است از من دوری می‌کند، احساس یأس می‌کنم.',
                 'Q57': '57: نسبت به انگیزه‌های دیگران سوء ظن شدید دارم.',
                 'Q58': '58: احساس می‌کنم که از مردم بیگانه بریده شدم.',
                 'Q59': '59: احساس می‌کنم دوست داشتنی نیستم.',
                 'Q60': '60: می‌توانم مانند اغلب افراد در کارهایم با استعداد باشم.',
                 'Q61': '61: اصلاً به قضاوت های خودم در موقعیت‌های روزمره اعتماد ندارم.',
                 'Q62': '62: می‌ترسم تمام سرمایه‌ی خود را از دست بدهم و بیچاره و فقیر شوم.',
                 'Q63': '63: اغلب احساس می‌کنم که انگار والدینم در من زندگی می‌کنند، من نمی‌توانم زندگی جداگانه‌ای برای خودم داشته باشم.',
                 'Q64': '64: همیشه به دیگران اجازه داده ام به جای من تصمیم بگیرند، در نتیجه من واقعاً نمی‌دانم چه می‌خواهم.',
                 'Q65': '65: من همیشه سنگ صبور دیگران بوده‌ام و به مشکلات آن‌ها گوش داده‌ام.',
                 'Q66': '66: آنقدر خودم را کنترل می‌کنم که افراد فکر می‌کنند آدم بدون هیجان و بی‌احساس هستم.',
                 'Q67': '67: احساس می‌کنم برای پیشرفت و دستیابی به خواسته‌های خود همواره تحت فشار هستم.',
                 'Q68': '68: احساس می‌کنم نباید از قانون‌ها و قراردادهای به هنجاری که مردم تابع آن‌ها هستند، اطاعت کنم.',
                 'Q69': '69: نمی‌توانم به خود فشار بیاورم که کارهایی که برایم خوش‌آیند نیستند را انجام دهم، حتی وقتی که می‌دانم نتایج خوبی در پی دارند.',
                 'Q70': '70: اگر در مجالسی اظهار نظر کنم یا در موقعیت‌های اجتماعی آغازگر بحث باشم، برایم مهم است که دیگران مرا بشناسند و تأیید کنند.',
                 'Q71': '71: وقتی کاری می‌کنم برایم مهم نیست که چقدر سخت است اما نگرانم از لحاظ مالی ورشکست بشوم و همه‌ی دارایی‌هایم را از دست بدهم.',
                 'Q72': '72: وقتی کار اشتباهی انجام می‌دهم، برایم مهم نیست که چرا اشتباه می‌کنم، باید تاوان آن را بپردازم.',
                 'Q73': '73: وقتی نمی‌دانستم کاری را چگونه انجام دهم، شخص عاقل و ماهری را پیدا نمی‌کردم که مرا راهنمایی و نصیحت کند.',
                 'Q74': '74: برخی اوقات آنقدر نگران آن هستم که نکند افراد مرا ترک کنند که از آن‌ها دوری می‌کنم.',
                 'Q75': '75: به طور جدی به انگیزه‌های نهانی مردم فکر می‌کنم.',
                 'Q76': '76: همیشه احساس می‌کنم که در بین افراد گروه جایی ندارم.',
                 'Q77': '77: در بسیاری از موقعیت‌ها برای نشان دادن یا ابراز کردن خودم از طرف دیگران پذیرفتنی نیستم.',
                 'Q78': '78: در کار یا تحصیل مثل بقیه باهوش نیستم.',
                 'Q79': '79: احساس می‌کنم قادر نیستم به تنهایی مسائلی که برایم اتفاق می‌افتد را حل کنم.',
                 'Q80': '80: اغلب نگرانم که دچار یک بیماری جدی شوم، حتی وقتی که دلایل پزشکی کمی برای این احتمال وجود دارد.',
                 'Q81': '81: اغلب احساس می‌کنم که هویت جداگانه‌ای از والدین و همسرم ندارم.',
                 'Q82': '82: خیلی برایم مشکل است از دیگران تقاضا کنم که حقوقم را رعایت و احساساتم را درک کنند.',
                 'Q83': '83: نظر دیگران این است که من برای دیگران خیلی کار می‌کنم ولی برای خودم کاری انجام نمی‌دهم.',
                 'Q84': '84: مردم نظرشان این است که من از نظر هیجانی ضعیف هستم.',
                 'Q85': '85: وقتی کاری را اشتباه انجام می‌دهم، نمی‌توانم خودم را ببخشم یا برای اشتباهم بهانه تراشی می‌کنم.',
                 'Q86': '86: احساس می‌کنم کاری که من برای دیگران انجام می‌دهم بیشتر از کارهایی است که آن‌ها برای من انجام می‌دهند.',
                 'Q87': '87: به ندرت توانسته‌ام به تصمیم خودم پایبند باشم.',
                 'Q88': '88: تحسین زیاد در من این احساس را ایجاد می‌کند که فرد باارزشی هستم.',
                 'Q89': '89: نگرانم از اینکه تصمیم اشتباهی بگیرم زیرا آن موجب بدبختی‌ام می‌شود.',
                 'Q90': '90: فرد بدی هستم و سزاوار تنبیه می‌باشم.'}

    last_q = 'Q' + str(len(QUESTIONS))
    resault_tempalte = {
        'رهاشدگی بی ثباتی': 0,
        'انزوای اجتماعی، بیگانگی': 0,
        'نگرانی / بدبینی': 0,
        'بازداری هیجانی': 0,
        'وابستگی / بی‌کفایتی عملی': 0,
        'پذیرش‌جویی جلب توجه': 0,
        'محرومیت‌های هیجانی': 0,
        'آسیب نسبت به ضرر و بیماری': 0,
        'گرفتاری': 0,
        'اطاعت': 0,
        'معیارهای سخت‌گیرانه': 0,
        'خود تنبیهی': 0,
        'نقص / شرم': 0,
        'بی‌اعتمادی بدرفتاری': 0,
        'شکست': 0,
        'ایثار': 0,
        'استحقاق بزرگ‌منشی': 0,
        'خویشتن داری ناکافی': 0}

    resault_map = {
        'رهاشدگی بی ثباتی': [2, 20, 38, 56, 74],
        'انزوای اجتماعی، بیگانگی': [4, 22, 40, 58, 76],
        'نگرانی / بدبینی': [17, 35, 53, 71, 89],
        'بازداری هیجانی': [12, 30, 48, 66, 84],
        'وابستگی / بی‌کفایتی عملی': [7, 25, 43, 61, 79],
        'پذیرش‌جویی جلب توجه': [16, 34, 52, 70, 88],
        'محرومیت‌های هیجانی': [1, 19, 37, 55, 73],
        'آسیب نسبت به ضرر و بیماری': [8, 26, 44, 62, 80],
        'گرفتاری': [9, 27, 45, 63, 81],
        'اطاعت': [10, 28, 46, 64, 82],
        'معیارهای سخت‌گیرانه': [13, 31, 49, 67, 85],
        'خود تنبیهی': [18, 36, 54, 72, 90],
        'نقص / شرم': [5, 23, 41, 59, 77],
        'بی‌اعتمادی بدرفتاری': [3, 21, 39, 57, 75],
        'شکست': [6, 24, 42, 60, 78],
        'ایثار': [11, 29, 47, 65, 83],
        'استحقاق بزرگ‌منشی': [14, 32, 50, 68, 86],
        'خویشتن داری ناکافی': [15, 33, 51, 69, 87]}

    @classmethod
    def keyboard_generator(cls, question: str, active_index=None):
        buttons = [
            [
                InlineKeyboardButton(text=f'👉 {i}', callback_data=f'{question}-{i}') if active_index == i
                else InlineKeyboardButton(text=f'  {i}  ', callback_data=f'{question}-{i}')
                for i in range(1, 7)
            ]
        ]
        question_temp = question.replace('Q', '')
        next_q = 'Q' + str(int(question_temp) + 1)
        previous_q = 'Q' + str(int(question_temp) - 1)
        if cls.QUESTIONS.get(next_q) != None:
            buttons.append([InlineKeyboardButton(
                'بعدی', callback_data='next-' + next_q)])

        if cls.QUESTIONS.get(previous_q) != None:
            buttons.append([InlineKeyboardButton(
                'قبلی', callback_data='previous-' + previous_q)])

        if question == cls.last_q:
            buttons.append([InlineKeyboardButton(
                'پایان', callback_data='finish-' + question)])

        return InlineKeyboardMarkup(buttons)


class Schema_Mind_Questions:
    help_text = """راهنمای انجام تست‌ها:

فهرست زیر حاوی جمله‌هایی است که یک شخص ممکن است برای توصیف خودش از آنها استفاده کند. لطفا هر جمله را با دقت بخوانید و ببینید تا چه حد شما را درست توصیف می‌کند.
اگر شما برای پاسخ دادن خاطر جمع نیستید، بر پایه‌ی چیزی که احساس می‌کنید، جواب دهید نه بر اساس آنچه فکر می‌کنید درست است.
تعدادی از جملات در مورد رابطه با والدینتان و یا والدینی تخیلی می‌باشد. چنانچه هر یک از والدینتان یا هر دوی آنها فوت شده‌اند، لطفا به این جملات بر اساس ارتباطتان با والدینتان وقتی که آنها زنده بوده‌اند پاسخ دهید؛ اگر در گذشته با والدینتان بوده‌اید اما در حال حاضر نیستید، لطفا به جملات بر اساس آخرین و مهمترین ارتباط رومانتیک پاسخ دهید.
یکی از شماره‌های 1 تا 6 از مقیاس درجه بندی که بهترین توصیف از شما را ارائه می‌دهد انتخاب کنید:‌ 
کاملاً غلط = 1
تقریبا غلط = 2
بیشتر درست است تا غلط = 3
اندکی درست = 4
تقریبا درست = 5
کاملاً درست = 6
 سپس نمره‌ی مربوطه را علامت بزنید. """ 
 
    QUESTIONS = {'Q1': '1: دیگران باید به من احترام بگذارند و در عین حال حق ندارند به من امر و نهی کنند.', 
                 'Q2': '2: احساس می‌کنم دیگران مرا قبول دارند و می‌پذیرند.', 
                 'Q3': '3: خودم را لایق لذت نمی‌دانم.', 
                 'Q4': '4: احساس می‌کنم که اساساً آدم بی کفایت، نالایق و بی ارزشی هستم.', 
                 'Q5': '5: برای تنبیه خودم، تکانه‌های آسیب زایی دارم. (مثل جراحت وارد کردن به خودم)', 
                 'Q6': '6: احساس سرگشتگی می‌کنم.', 
                 'Q7': '7: برای من سخت است که شخصیت واقعی‌ام را نشان بدهم.', 
                 'Q8': '8: سخت تلاش می‌کنم برای جلوگیری از تعارض، جر و بحث یا طرد شدن، مردم دار باشم.', 
                 'Q9': '9: نمی‌توانم خودم را ببخشم.', 
                 'Q10': '10: دست به کارهایی می‌زنم تا محور توجه دیگران قرار بگیرم.', 
                 'Q11': '11: وقتی دیگران به خواسته‌های من بی توجهی می‌کنند، عصبی می‌شوم.', 
                 'Q12': '12: در کنترل تکانه‌هایم مشکل دارم.', 
                 'Q13': '13: اگر به هدفم نرسم، به راحتی ناکام می‌شوم و دست از کار می‌کشم.', 
                 'Q14': '14: خشم و غیظ شدیدی دارم.', 
                 'Q15': '15: تکانشی رفتار می‌‌کنم یا سریع هیجان‌هایم را بروز می‌دهم به نحوی که موجب آزردگی خاطر دیگران یا آشفتگی خاطر خودم می‌شوم.', 
                 'Q16': '16: اگر اتفاقات بدی رخ می‌دهد، به دلیل عیب و ایرادهای من است.', 
                 'Q17': '17: احساس آرامش و خوشبختی می‌کنم.', 
                 'Q18': '18: خودم را طبق میل دیگران تغییر می‌دهم تا مرا دوست داشته باشند یا تاییدم کنند.', 
                 'Q19': '19: احساس می‌کنم به دیگران تعلق خاطر دارم.', 
                 'Q20': '20: وقتی مشکلی برایم پیش بیاید، سخت تلاش می‌کنم تا خودم آن را حل و فصل کنم.', 
                 'Q21': '21: برای انجام کارهای روزمره‌ یا خسته کننده، نظم و پشتکار ندارم.', 
                 'Q22': '22: اگر با دیگران نجنگم، از من سوء استفاده می‌کنند یا مرا نادیده می‌گیرند.', 
                 'Q23': '23: مجبورم از اطرافیانم مراقبت کنم.', 
                 'Q24': '24: اگر به دیگران اجازه بدهید که به شما زور بگویند یا شما را مسخره کنند، بازنده‌ی نهایی شما هستید.', 
                 'Q25': '25: وقتی از دست دیگران عصبانی هستم، به آنها حمله می‌کنم.', 
                 'Q26': '26: اگر عصبانی بشوم، اغلب نمی‌توانم جلوی خودم را بگیرم و قشقرق راه می‌اندارم.', 
                 'Q27': '27: مهمترین مسئله‌ی زندگی من این است که نفر اول باشم (مثل مشهورترین، موفق‌ترین، سالم‌ترین و قدرتمندترین).', 
                 'Q28': '28: نسبت به خیلی چیزها بی تفاوت هستم.', 
                 'Q29': '29: می‌توانم مشکلاتم را عاقلانه حل کنم، بدون اینکه اجازه دهم هیجان‌هایم مرا از پای در آورند.', 
                 'Q30': '30: چاره اندیشی برای موقعیت‌ها، کاری عبث و مسخره است.', 
                 'Q31': '31: به هیچ وجه نمی‌توانم توقعاتم را کم کنم.', 
                 'Q32': '32: حمله، بهترین دفاع است.', 
                 'Q33': '33- نسبت به دیگران، بی‌تفاوت، نامهربان و سنگدل هستم.', 
                 'Q34': '34- کاملا بی‌تفاوتم (باخودم، با هیجان‌هایم و با اطرافیانم هیچگونه ارتباطی ندارم).', 
                 'Q35': '35- من مرید چشم و گوش بسته‌ی هیجان‌هایم هستم.', 
                 'Q36': '36- کارد به استخوانم رسیده است (کاملاً مستاصلم).', 
                 'Q37': '37- به دیگران اجازه‌ می‌دهم که مرا دست کم بگیرند و از من انتقاد کنند.', 
                 'Q38': '38- در روابط اجتماعی به طرف مقابل اجازه می‌دهم که بر من مسلط شود.', 
                 'Q39': '39- احساس می‌کنم که از مردم فاصله گرفته‌ام.', 
                 'Q40': '40- بدون فکر حرف می‌زنم و دیگران آزره خاطر می‌شوند یا بعداً از این کار شرمنده می‌شوم.', 
                 'Q41': '41- سخت کار می‌کنم یا به ورزش می‌پردازم تا به مشکلات آشفته ساز فکر نکنم.', 
                 'Q42': '42- از دست کسانی که تلاش می‌کنند آزادی یا استقلال مرا بگیرند، عصبانی می‌شوم.', 
                 'Q43': '43- احساس می‌‌کنم اصلاً وجود ندارم.', 
                 'Q44': '44- من بدون توجه به احساس‌ها و نیازهای دیگران، هر کاری دلم بخواهد انجام می‌دهم.', 
                 'Q45': '45- اصلاً نمی‌توانم به خودم استراحت و آرامش بدهم یا تفریح کنم، مگر اینکه همه‌ی کارها را مطابق معیارهایم انجام دهم.', 
                 'Q46': '46- وقتی عصبانی هستم هر چیزی که دم دستم باشد، پرت می‌کنم.', 
                 'Q47': '47- از دست دیگران خونم به جوش آمده است.', 
                 'Q48': '48- احساس می‌کنم که به دیگران تعلق خاطر دارم.', 
                 'Q49': '49- خشم زیادی در درون من نهفته است، به گونه‌ای که باید این خشم را رها کنم.', 
                 'Q50': '50- احساس تنهایی می‌کنم.', 
                 'Q51': '51- تلاش می‌کنم در هر کاری بهترین باشم.', 
                 'Q52': '52- دوست دارم برای فرار از احساس‌هایم دست به فعالیت‌های آرامش بخش یا هیجان‌انگیز بزنم (مثل کار کردن، خوردن، خرید کردن یا تماشای تلویزیون).', 
                 'Q53': '53- تساوی اصلاً وجود ندارد، بنابراین بهتر است که از دیگران برتر باشید.', 
                 'Q54': '54- وقتی عصبانی هستم، اغلب کنترلم را از دست می‌دهم و دیگران را تهدید می‌کنم.', 
                 'Q55': '55- به جای اینکه خودم نیازهای را بیان کنم به دیگران اجازه می‌دهم راه خودشان را بروند.', 
                 'Q56': '56- اگر کسی با من موافق نباشد، پس علیه من است.', 
                 'Q57': '57- برای اینکه کمتر تحت تأثیر افکار و احساسات آشفته ساز قرار بگیرم، باید همیشه دست به دامن کار شوم.', 
                 'Q58': '58- اگر از دست دیگران عصبانی شوم، آدم بدی هستم.', 
                 'Q59': '59- نمی‌خواهم با مردم ارتباط برقرار کنم.', 
                 'Q60': '60- آنقدر عصبانی هستم که ممکن است به کسی آسیب بزنم یا او را بکشم.', 
                 'Q61': '61- احساس می‌کنم که لیاقت دارم که زندگی با ثبات و ایمنی داشته باشم.', 
                 'Q62': '62- می‌دانم که چه موقع هیجان‌هایم را نشان بدهم و چه موقع دست به این کار نزنم.', 
                 'Q63': '63- اگر کسی من را تنها بگذارد یا به حال خودم رها کند عصبانی می‌شوم.', 
                 'Q64': '64- احساس می‌کنم با مردم رابطه ندارم.', 
                 'Q65': '65- خودم را وادار به انجام‌ کارهای ناخوشایند نمی‌کنم، حتی اگر بدانم انجام چنین کارهایی به نفع من است.', 
                 'Q66': '66- قانون شکنی می‌کنم و بعدش پشیمان می‌شوم.', 
                 'Q67': '67- احساس شرمساری می‌کنم.', 
                 'Q68': '68- به بیشتر مردم اعتماد دارم.', 
                 'Q69': '69- اول عمل می‌کنم، بعد به کارم فکر می‌کنم.', 
                 'Q70': '70- خیلی زود بی‌حوصله می‌شوم و علاقه‌ام را از دست می‌دهم.', 
                 'Q71': '71-حتی در جمع نیز احساس تنهایی می‌کنم.', 
                 'Q72': '72- نمی‌توانم به خودم اجازه بدهم که مثل بقیه‌ی مردم، دست به فعالیت‌هایی لذت بخش بزنم چون آدم خوبی نیستم.', 
                 'Q73': '73- خواسته‌هایم را بیان می‌کنم، بدون اینکه آرامش خودم را از دست بدهم.',
                 'Q74': '74- احساس می‌کنم در مقایسه با بیشتر مردم، آدم بهتر و خاصی هستم.', 
                 'Q75': '75- نمی‌خواهم از چیزی مراقبت کنم، این موضوع هیچ اهمیتی برای من ندارد.', 
                 'Q76': '76- وقتی که دیگران به من می‌گویند که چه احساسی باید داشته باشم یا باید چه رفتاری در پیش بگیرم، عصبانی می‌شوم.', 
                 'Q77': '77- اگر بر دیگران تسلط پیدا نکنید آنها بر شما مسلط می‌شوند.', 
                 'Q78': '78- من بدون توجه به پیامدها، احساس‌هایم را بازگو می‌‌کنم یا دست به اعمال تکانشی می‌زنم.', 
                 'Q79': '79- دوست دارم دیگران را به دلیل نوع برخوردشان با من، موأخضه کنم.', 
                 'Q80': '80- قادرم از خودم مراقبت کنم.', 
                 'Q81': '81- به دیگران خیلی ایراد می‌گیرم.', 
                 'Q82': '82- برای رسیدن به اهداف و خواسته‌هایم، تحت فشار دائمی هستم.', 
                 'Q83': '83- تلاش می‌کنم که مرتکب اشتباه نشوم،‌ چون در غیر اینصورت خودم را تحقیر می‌‌کنم.', 
                 'Q84': '84- مستحق تنبیه شدن هستم.', 
                 'Q85': '85- می‌توانم تغییر کنم، یادبگیرم و پیشرفت کنم.', 
                 'Q86': '86- می‌خواهم به افکار و احساسات آشفته ساز توجه نکنم.', 
                 'Q87': '87- از دست خودم عصبانی هستم.', 
                 'Q88': '88- هیچ احساسی ندارم.', 
                 'Q89': '89- مجبورم در هر کاری که انجام می‌دهم، بهترین باشم.', 
                 'Q90': '90- برای دستیابی به معیارهایم، لذت، سلامتی و خوشحالی را فدا کردم.', 
                 'Q91': '91- از دیگران توقع زیادی دارم.', 
                 'Q92': '92- اگر عصبانی بشوم، کنترلم را از دست می‌دهم به گونه‌ای که به دیگران صدمه می‌زنم.', 
                 'Q93': '93- آسیب پذیرم.', 
                 'Q94': '94- آدم بدی هستم.', 
                 'Q95': '95- احساس امنیت می‌کنم.', 
                 'Q96': '96- احساس می‌کنم که دیگران مرا درک می‌کنند، به حرف دلم گوش می‌دهند و تأییدم می‌کنند.', 
                 'Q97': '97- کنترل تکانه‌هایم غیرممکن است.', 
                 'Q98': '98- وقتی عصبانی هستم، وسایل دم دستم را می‌شکنم.', 
                 'Q99': '99- اگر بر دیگران سلطه پیدا کنید، اتفاقی برای شما نمی‌افتد.', 
                 'Q100': '100- به شیوه‌ای منفعلانه رفتار می‌کنم، حتی زمانی که مایل به انجام این سبک و سیاق نیستم.', 
                 'Q101': '101- خشم من غیر قابل کنترل است', 
                 'Q102': '102- به دیگران زور می‌گویم و آنها را به باد تمسخر می‌گیرم.', 
                 'Q103': '103- احساس می‌کنم دوست دارم افراد به خاطر کاری که در قبال من انجام داده‌اند، آزرده خاطر سازم یا به باد انتقام بگیرم.', 
                 'Q104': '104- چون می‌دانم چه چیزی “درست” یا “غلط” است، بنابراین سخت در تلاشم تا کار درست را انجام دهم وگرنه از خودم عیب جویی می‌‌کنم.', 
                 'Q105': '105- اغلب احساس می‌کنم در دنیا تنها هستم.', 
                 'Q106': '106- احساس ضعف و درماندگی می‌کنم.', 
                 'Q107': '107- آدم تنبلی هستم.', 
                 'Q108': '108- می‌توانم تمام کارهایی را که افراد مهم زندگی‌ام انجام می‌دهند تحمل کنم.', 
                 'Q109': '109- احساس می‌کنم از من سوء استفاده شده یا با من ناعادلانه رفتار کرده‌اند.', 
                 'Q110': '110- اگر به انجام کاری تمایل پیدا کنم، حتماً آن را انجام می‌دهم.', 
                 'Q111': '111- احساس می‌کنم از قلم افتاده‌ام یا نادیده گرفته شدم.', 
                 'Q112': '112- دیگران را تحقیر می‌کنم.', 
                 'Q113': '113- احساس خوشبختی می‌کنم.', 
                 'Q114': '114- احساس می‌کنم من نباید مطبع همان قواعدی باشم که دیگران مجبور به رعایت آنها هستند.', 
                 'Q115': '115- زندگی من در حال حاضر پیرامون این مسأله می‌چرخد که چه کارهایی را انجام داده‌ام و چه کارهایی را باید خوب انجام دهم.', 
                 'Q116': '116- خودم را تنبیه می‌کنم تا مسئولیت پذیرتر از بیشتر مردم باشم.',
                 'Q117': '117- وقتی احساس کنم غیر منصفانه به من ایراد گرفته شده، از من سوء استفاده شده یا با من بدرفتاری می‌کنند، می‌توانم حقم را بگیرم.', 
                 'Q118': '118- وقتی اتفاق ناگواری برمن رخ بدهد، لیاقت همدردی دیگران را ندارم.', 
                 'Q119': '119- احساس می‌کنم که هیچکس مرا دوست ندارد.', 
                 'Q120': '120- احساس می‌کنم در واقع آدم خوبی هستم.', 
                 'Q121': '121- اگر لازم باشد برای دستیابی به ارزش‌هایم، کارهای تکراری و کسل کننده را انجام می‌دهم.', 
                 'Q122': '122- احساس شوخ طبعی و خود انگیختگی می‌کنم.', 
                 'Q123': '123- می‌توانم چنان عصبانی شوم که فردی را بکشم.', 
                 'Q124': '124- از هویت خودم و کاری که برای شادکامی خودم انجام می‌دهم، احساس خوبی دارم.'}


    last_q = 'Q' + str(len(QUESTIONS))
    resault_tempalte = {
        'ذهنیت کودک آسیب پذیر': 0,
        'ذهنیت کودک عصبانی': 0,
        'ذهنیت کودک غضبناک': 0,
        'ذهنیت کودک تکانشی': 0,
        'کودک بی‌انضباط': 0,
        'ذهنیت کودک شاد': 0,
        'ذهنیت تسلیم شده‌ی مطیع': 0,
        'ذهنیت محافظ بی‌تفاوت': 0,
        'ذهنیت خود آرام بخش بی‌تفاوت': 0,
        'ذهنیت خود بزرگ منش': 0,
        'ذهنیت زورگو و تهاجمی': 0,
        'ذهنیت والد تنبیه‌گر': 0,
        'ذهنیت والد پر‌توقع': 0,
        'ذهنیت بزرگسال سالم': 0
        }

    resault_map = {
        'ذهنیت کودک آسیب پذیر': [4,6,36,50,67,71,105,111,119],
        'ذهنیت کودک عصبانی': [22,42,47,49,56,63,76,79,103,109],
        'ذهنیت کودک غضبناک': [14,25,26,46,54,60,92,98,101,123],
        'ذهنیت کودک تکانشی': [12,15,35,40,61,69,78,97,110],
        'کودک بی‌انضباط': [13,21,30,65,70,107],
        'ذهنیت کودک شاد': [2,16,17,19,48,61,68,95,96,113,122],
        'ذهنیت تسلیم شده‌ی مطیع': [8,18,37,38,55,100,108],
        'ذهنیت محافظ بی‌تفاوت': [28,33,34,39,43,59,64,75,88],
        'ذهنیت خود آرام بخش بی‌تفاوت': [41,52,57,86],
        'ذهنیت خود بزرگ منش': [10,11,27,31,44,74,81,89,91,114],
        'ذهنیت زورگو و تهاجمی': [1,24,32,53,77,93,99,102,112],
        'ذهنیت والد تنبیه‌گر': [3,5,9,16,58,72,84,87,94,118],
        'ذهنیت والد پر‌توقع': [7,23,45,51,82,83,90,104,115,116],
        'ذهنیت بزرگسال سالم': [20,29,62,73,80,85,117,120,121,124]
        }

    @classmethod
    def keyboard_generator(cls, question: str, active_index=None):
        buttons = [
            [
                InlineKeyboardButton(text=f'👉 {i}', callback_data=f'{question}-{i}') if active_index == i
                else InlineKeyboardButton(text=f'  {i}  ', callback_data=f'{question}-{i}')
                for i in range(1, 7)
            ]
        ]
        question_temp = question.replace('Q', '')
        next_q = 'Q' + str(int(question_temp) + 1)
        previous_q = 'Q' + str(int(question_temp) - 1)
        if cls.QUESTIONS.get(next_q) != None:
            buttons.append([InlineKeyboardButton(
                'بعدی', callback_data='next-' + next_q)])

        if cls.QUESTIONS.get(previous_q) != None:
            buttons.append([InlineKeyboardButton(
                'قبلی', callback_data='previous-' + previous_q)])

        if question == cls.last_q:
            buttons.append([InlineKeyboardButton(
                'پایان', callback_data='finish-' + question)])

        return InlineKeyboardMarkup(buttons)
